TOKEN = "5759758204:AAFTMAI05zF6UAIPg4iIQ8S0S9FmYyQ_Hro"

exchanges = {
    'Австралийский доллар': 'AUD',
    'Российский рубль': 'RUB',
    'Фунт стерлингов Соединенного королевства': 'GBP',
    'Белорусский рубль': 'BYN',
    'Доллар США': 'USD',
    'Евро': 'EUR',
    'Индийских рупий': 'INR',
    'Казахстанских тенге': 'KZT',
    'Канадский доллар': 'CAD',
    'Китайских юаней': 'CNY',
    'Японских иен': 'JPY',
    }

# Особый словарь для взаимодействия с пользователем
user_exchanges = {
    'доллар': 'USD',
    'доллары': 'USD',
    'доллара': 'USD',
    'долларов': 'USD',
    'доллар сша': 'USD',
    'доллара сша': 'USD',
    'долларов сша': 'USD',
    'американский доллар': 'USD',
    'американских доллара': 'USD',
    'американского доллара': 'USD',
    'американских долларов':  'USD',
    'usd': 'USD',
    'евро': 'EUR',
    'евра': 'EUR',
    'eur': 'EUR',
    'российский рубль': 'RUB',
    'российского рубля': 'RUB',
    'российских рублей': 'RUB',
    'рубль': 'RUB',
    'рубля': 'RUB',
    'рублей': 'RUB',
    'рубли': 'RUB',
    'рубль россии': 'RUB',
    'рубля россии': 'RUB',
    'рублей россии': 'RUB',
    'рубль рф': 'RUB',
    'рубля рф': 'RUB',
    'рублей рф': 'RUB',
    'rub': 'RUB',
    }

payload = {}
headers = {
  "apikey": "yWbnshApEfhuKmIOerNHhOmVpOnuDGrO"
}
